{
  "name": "Empty State CTA on Chats List Screen",
  "branchName": "feature/empty-state-cta-chats",
  "userStories": [
    {
      "id": "US-001",
      "title": "Pressable Empty State Row with Navigation",
      "description": "As a new user viewing the chats list with no plants, I want to tap the \"Name a plant to start chatting!\" area so that I'm taken to the screen where I can name my first plant.",
      "acceptanceCriteria": [
        "The empty state renders a horizontally-laid-out row: text on the left, circular icon button on the right",
        "The row is vertically centered on the screen (matching current empty state positioning)",
        "The entire row (text + icon) is a single pressable area using TouchableOpacity or Pressable",
        "Pressing anywhere on the row navigates to the root screen (/) via router.push(\"/\")",
        "The circular icon contains an \"arrow.up.right\" SF Symbol (or equivalent) matching the existing IconSymbol pattern",
        "The circle button matches the existing SubmitButton visual style (rounded, bg-tint background, appropriate size)",
        "The text \"Name a plant to start chatting!\" is preserved",
        "Accessibility: the pressable area has accessibilityRole=\"button\", an appropriate accessibilityLabel, and accessibilityHint describing the navigation destination"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Subtle Hop Animation on Arrow Icon",
      "description": "As a user seeing the empty state, I want the arrow icon to do a small repeating hop animation so that it subtly draws my attention to the call-to-action.",
      "acceptanceCriteria": [
        "The arrow icon performs a small vertical hop animation (translate Y, roughly 3-4px upward and back)",
        "The animation uses react-native-reanimated (consistent with existing animation patterns in the app)",
        "The animation loops continuously with a gentle easing (not jarring or fast)",
        "The animation is subtle — it should catch the eye without being distracting",
        "The animation does not interfere with the pressable behavior of the row",
        "The animation uses useNativeDriver equivalent (Reanimated worklets) for smooth performance"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [
        "US-001"
      ],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-07T16:15:14.906Z"
  }
}